* what is pandas
    => Pandsa is open source open library written in python
    => It leverages the power and speed of numpy to make analysis and processing easy for data scientists
    => It provides rich and highly rebust data operatins
* Pandas data structures
    => Pandas has two types of data structure
     1. Series - It is onde dimensional array with structure. It stores a single coloum or row of data in a DataFrame
     2. Dataframe - It is a tabular spreadsheet like structure representing rows each of which one or multiple coloums
* A one-dimensional array(labeled) capable of holding any type of data Series 
* A tow-dimensional data(labeled) structure with coloums of potentially different type of data - frame

In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "Students Name":["Ajay Kumar","Chandan Roy","Manohar Suman","Sumit Gupta","Akash Anand"],
    "Students Marks":[60,70,80,90,100],
    "Students Cities":["Darbhanga","Patna","Madhubani","MujhaffarPUr","Chapra"]
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

   Students Name  Students Marks Students Cities
0     Ajay Kumar              60       Darbhanga
1    Chandan Roy              70           Patna
2  Manohar Suman              80       Madhubani
3    Sumit Gupta              90    MujhaffarPUr
4    Akash Anand             100          Chapra

In [6]:
df.to_csv('studentsDetails.csv') # It will convert the data in excel file with index

In [7]:
df.to_csv('datalist.csv', index=False) # It will convert data set in excel sheet without index

In [8]:
df.head(2) # It will show the top 2 rows

  Students Name  Students Marks Students Cities
0    Ajay Kumar              60       Darbhanga
1   Chandan Roy              70           Patna

In [9]:
df.tail(3) # It will show bottom 3 rows

   Students Name  Students Marks Students Cities
2  Manohar Suman              80       Madhubani
3    Sumit Gupta              90    MujhaffarPUr
4    Akash Anand             100          Chapra

In [10]:
df.describe() # It will return the list of numberical analysis

       Students Marks
count        5.000000
mean        80.000000
std         15.811388
min         60.000000
25%         70.000000
50%         80.000000
75%         90.000000
max        100.000000

In [11]:
Data = pd.read_csv('train.csv') # It will read all csv data

In [12]:
Data

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,Unnamed: 0.1.1.1.1,Unnamed: 0.1.1.1.1.1,Train No,Speeds,Cities
0,0,0,0,0,0,0,12560,199,Darbhanga
1,1,1,1,1,1,1,12630,70,Patna
2,2,2,2,2,2,2,12740,80,Madhubani
3,3,3,3,3,3,3,13555,90,MujhaffarPUr
4,4,4,4,4,4,4,18590,100,Chapra

In [13]:
Data['Speeds'] # It return all data of Speeds coloum

0    199
1     70
2     80
3     90
4    100
Name: Speeds, dtype: int64

In [14]:
Data['Speeds'][0] # It return data of speeds of index 0th position

199

In [15]:
Data['Speeds'][0] = 199

c:\users\ajay\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [16]:
Data

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,Unnamed: 0.1.1.1.1,Unnamed: 0.1.1.1.1.1,Train No,Speeds,Cities
0,0,0,0,0,0,0,12560,199,Darbhanga
1,1,1,1,1,1,1,12630,70,Patna
2,2,2,2,2,2,2,12740,80,Madhubani
3,3,3,3,3,3,3,13555,90,MujhaffarPUr
4,4,4,4,4,4,4,18590,100,Chapra

In [17]:
Data.to_csv('train.csv') # It will update the train csv file

In [18]:
Data.index = ["First","Second","Third","Fourth","Fifth"] # It will update the index

In [19]:
Data

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,Unnamed: 0.1.1.1.1,Unnamed: 0.1.1.1.1.1,Train No,Speeds,Cities
First,0,0,0,0,0,0,12560,199,Darbhanga
Second,1,1,1,1,1,1,12630,70,Patna
Third,2,2,2,2,2,2,12740,80,Madhubani
Fourth,3,3,3,3,3,3,13555,90,MujhaffarPUr
Fifth,4,4,4,4,4,4,18590,100,Chapra

In [20]:
ser = pd.Series(np.random.rand(35)) # It return series of random data

In [21]:
ser

0     0.219490
1     0.692100
2     0.742922
3     0.970999
4     0.797064
5     0.230882
6     0.338651
7     0.705226
8     0.483264
9     0.536814
10    0.456534
11    0.932859
12    0.852088
13    0.855849
14    0.874321
15    0.158499
16    0.728647
17    0.139228
18    0.882137
19    0.811697
20    0.435342
21    0.653713
22    0.112828
23    0.034176
24    0.903691
25    0.764412
26    0.755032
27    0.465636
28    0.374345
29    0.582025
30    0.574660
31    0.346487
32    0.467779
33    0.831533
34    0.694670
dtype: float64

In [22]:
type(ser)

pandas.core.series.Series

In [23]:
newDf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [24]:
newDf

            0         1         2         3         4
0    0.129134  0.766987  0.083507  0.699666  0.803687
1    0.228043  0.028468  0.327368  0.368833  0.307289
2    0.461548  0.491607  0.116840  0.015457  0.415863
3    0.918650  0.720470  0.969290  0.860569  0.886675
4    0.576811  0.689432  0.619212  0.908734  0.009300
..        ...       ...       ...       ...       ...
329  0.724116  0.049298  0.392274  0.688938  0.968888
330  0.589899  0.102864  0.143019  0.402435  0.313228
331  0.632043  0.633677  0.286392  0.335941  0.308841
332  0.979890  0.469872  0.055230  0.808659  0.506339
333  0.079984  0.496517  0.721810  0.883720  0.906174

[334 rows x 5 columns]

In [25]:
type(newDf)

pandas.core.frame.DataFrame

# describe() method

In [26]:
newDf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.476116    0.499965    0.471192    0.491727    0.499413
std      0.287624    0.294059    0.283763    0.304430    0.286672
min      0.000082    0.003131    0.003660    0.001302    0.006998
25%      0.207071    0.260628    0.232213    0.217320    0.252833
50%      0.492107    0.498057    0.449272    0.478152    0.505258
75%      0.729289    0.764127    0.706336    0.750208    0.738117
max      0.999912    0.986723    0.992877    0.996180    0.997164

In [27]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [28]:
newDf.head()

          0         1         2         3         4
0  0.129134  0.766987  0.083507  0.699666  0.803687
1  0.228043  0.028468  0.327368  0.368833  0.307289
2  0.461548  0.491607  0.116840  0.015457  0.415863
3  0.918650  0.720470  0.969290  0.860569  0.886675
4  0.576811  0.689432  0.619212  0.908734  0.009300

In [29]:
newDf[0][0] = 'Ajay'

In [30]:
newDf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [31]:
newDf.head(2)

          0         1         2         3         4
0      Ajay  0.766987  0.083507  0.699666  0.803687
1  0.228043  0.028468  0.327368  0.368833  0.307289

In [32]:
newDf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [33]:
newDf.columns

RangeIndex(start=0, stop=5, step=1)

In [34]:
newDf.to_numpy() # it will convert pandas to numpy array

array([['Ajay', 0.7669869627018968, 0.08350731446268855,
        0.6996655729678158, 0.8036870726086744],
       [0.22804251274282294, 0.028467790552323846, 0.3273683382202852,
        0.36883285654087705, 0.3072886698415296],
       [0.46154841116584966, 0.4916074768244222, 0.11683978760793368,
        0.015456795308453786, 0.41586338547205326],
       ...,
       [0.6320429553164322, 0.6336774353503651, 0.286391945645166,
        0.33594065254290006, 0.30884121530746333],
       [0.9798900966461795, 0.46987218280816356, 0.055230069880152,
        0.8086594708569632, 0.5063392194553763],
       [0.07998350797630494, 0.4965168047215701, 0.7218096392117735,
        0.8837204193793139, 0.9061744110056552]], dtype=object)

# Data set transpose

In [35]:
newDf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,Ajay,0.228043,0.461548,0.91865,0.576811,0.850544,0.279807,0.0350258,0.633697,0.445332,...,0.977979,0.178106,0.576612,0.0186456,0.89345,0.724116,0.589899,0.632043,0.97989,0.0799835
1,0.766987,0.0284678,0.491607,0.72047,0.689432,0.899087,0.605292,0.923577,0.341696,0.850247,...,0.833491,0.159083,0.413478,0.18497,0.542637,0.0492978,0.102864,0.633677,0.469872,0.496517
2,0.0835073,0.327368,0.11684,0.96929,0.619212,0.526377,0.817814,0.02145,0.389605,0.748445,...,0.724459,0.572261,0.515481,0.932729,0.96694,0.392274,0.143019,0.286392,0.0552301,0.72181
3,0.699666,0.368833,0.0154568,0.860569,0.908734,0.446324,0.0997699,0.520623,0.727583,0.98294,...,0.232265,0.101035,0.34061,0.327229,0.762934,0.688938,0.402435,0.335941,0.808659,0.88372
4,0.803687,0.307289,0.415863,0.886675,0.00930005,0.785587,0.414385,0.381471,0.738334,0.0476387,...,0.874429,0.134463,0.251658,0.902315,0.626607,0.968888,0.313228,0.308841,0.506339,0.906174

# Sort data set by index

In [36]:
newDf.sort_index(axis = 0, ascending=False).head() # By default ascending is True and axix 0 is rows

             0         1         2         3         4
333  0.0799835  0.496517  0.721810  0.883720  0.906174
332    0.97989  0.469872  0.055230  0.808659  0.506339
331   0.632043  0.633677  0.286392  0.335941  0.308841
330   0.589899  0.102864  0.143019  0.402435  0.313228
329   0.724116  0.049298  0.392274  0.688938  0.968888

In [37]:
newDf.sort_index(axis = 1, ascending=False).head() # By default ascending is True and axix 1 is column

          4         3         2         1         0
0  0.803687  0.699666  0.083507  0.766987      Ajay
1  0.307289  0.368833  0.327368  0.028468  0.228043
2  0.415863  0.015457  0.116840  0.491607  0.461548
3  0.886675  0.860569  0.969290  0.720470   0.91865
4  0.009300  0.908734  0.619212  0.689432  0.576811

In [38]:
type(newDf[0])

pandas.core.series.Series

# Copy the data set

In [39]:
newDf2 = newDf[:] # this is the first way
newDf2 = newDf.copy() # this is second way the copy the data set

In [40]:
newDf2[0][0] = 584
newDf.head()

c:\users\ajay\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

          0         1         2         3         4
0      Ajay  0.766987  0.083507  0.699666  0.803687
1  0.228043  0.028468  0.327368  0.368833  0.307289
2  0.461548  0.491607  0.116840  0.015457  0.415863
3   0.91865  0.720470  0.969290  0.860569  0.886675
4  0.576811  0.689432  0.619212  0.908734  0.009300

In [41]:
newDf2.head()

          0         1         2         3         4
0       584  0.766987  0.083507  0.699666  0.803687
1  0.228043  0.028468  0.327368  0.368833  0.307289
2  0.461548  0.491607  0.116840  0.015457  0.415863
3   0.91865  0.720470  0.969290  0.860569  0.886675
4  0.576811  0.689432  0.619212  0.908734  0.009300

# Update the value without warning

In [42]:
newDf.loc[0,0] = 'change'

In [43]:
newDf.head()

          0         1         2         3         4
0    change  0.766987  0.083507  0.699666  0.803687
1  0.228043  0.028468  0.327368  0.368833  0.307289
2  0.461548  0.491607  0.116840  0.015457  0.415863
3   0.91865  0.720470  0.969290  0.860569  0.886675
4  0.576811  0.689432  0.619212  0.908734  0.009300

In [44]:
newDf.columns = list("ABCDE")

In [45]:
newDf.head(2)

          A         B         C         D         E
0    change  0.766987  0.083507  0.699666  0.803687
1  0.228043  0.028468  0.327368  0.368833  0.307289

In [46]:
newDf.loc[0,0] = 11 # here ti will insert extra row column

In [47]:
newDf.head(2)

          A         B         C         D         E     0
0    change  0.766987  0.083507  0.699666  0.803687  11.0
1  0.228043  0.028468  0.327368  0.368833  0.307289   NaN

In [48]:
newDf.loc[0,'A'] = 584
newDf.head(2)

          A         B         C         D         E     0
0       584  0.766987  0.083507  0.699666  0.803687  11.0
1  0.228043  0.028468  0.327368  0.368833  0.307289   NaN

# Drop the row or column

In [49]:
newDf.drop(0,axis=1).head() # axis = 0 is row and axis = 1 is column and will drop temp untill not store in new variable

          A         B         C         D         E
0       584  0.766987  0.083507  0.699666  0.803687
1  0.228043  0.028468  0.327368  0.368833  0.307289
2  0.461548  0.491607  0.116840  0.015457  0.415863
3   0.91865  0.720470  0.969290  0.860569  0.886675
4  0.576811  0.689432  0.619212  0.908734  0.009300

In [50]:
newDf.drop(0,axis=1, inplace = True) # it will modify original data set
newDf.head()

          A         B         C         D         E
0       584  0.766987  0.083507  0.699666  0.803687
1  0.228043  0.028468  0.327368  0.368833  0.307289
2  0.461548  0.491607  0.116840  0.015457  0.415863
3   0.91865  0.720470  0.969290  0.860569  0.886675
4  0.576811  0.689432  0.619212  0.908734  0.009300

# Show set of rows or column

In [51]:
newDf.loc[[1,2,3,4],['D','E']]

          D         E
1  0.368833  0.307289
2  0.015457  0.415863
3  0.860569  0.886675
4  0.908734  0.009300

In [52]:
newDf.loc[[1,2,3,4],:] # it will return 4 row and all column

          A         B         C         D         E
1  0.228043  0.028468  0.327368  0.368833  0.307289
2  0.461548  0.491607  0.116840  0.015457  0.415863
3   0.91865  0.720470  0.969290  0.860569  0.886675
4  0.576811  0.689432  0.619212  0.908734  0.009300

# How to run complex query?

In [53]:
newDf.loc[(newDf['A'] > 0.3)].head()

          A         B         C         D         E
0       584  0.766987  0.083507  0.699666  0.803687
2  0.461548  0.491607  0.116840  0.015457  0.415863
3   0.91865  0.720470  0.969290  0.860569  0.886675
4  0.576811  0.689432  0.619212  0.908734  0.009300
5  0.850544  0.899087  0.526377  0.446324  0.785587

In [54]:
newDf.loc[(newDf['A']< 0.3) & (newDf['B'] > .3 )].head()

            A         B         C         D         E
6    0.279807  0.605292  0.817814  0.099770  0.414385
7   0.0350258  0.923577  0.021450  0.520623  0.381471
12   0.116126  0.492614  0.154488  0.517854  0.453075
15   0.214285  0.682355  0.520349  0.200214  0.758834
17  0.0789375  0.303655  0.170914  0.217255  0.474816

# ilco

In [55]:
newDf.head()

          A         B         C         D         E
0       584  0.766987  0.083507  0.699666  0.803687
1  0.228043  0.028468  0.327368  0.368833  0.307289
2  0.461548  0.491607  0.116840  0.015457  0.415863
3   0.91865  0.720470  0.969290  0.860569  0.886675
4  0.576811  0.689432  0.619212  0.908734  0.009300

In [56]:
newDf.iloc[0,4] # it will return data at 0th column and 4th row

0.8036870726086744

In [57]:
newDf.iloc[1,1]

0.028467790552323846

In [58]:
newDf.iloc[[1,1],[1,2]]

          B         C
1  0.028468  0.327368
1  0.028468  0.327368

# Reset index

In [59]:
newDf.reset_index().head()

   index         A         B         C         D         E
0      0       584  0.766987  0.083507  0.699666  0.803687
1      1  0.228043  0.028468  0.327368  0.368833  0.307289
2      2  0.461548  0.491607  0.116840  0.015457  0.415863
3      3   0.91865  0.720470  0.969290  0.860569  0.886675
4      4  0.576811  0.689432  0.619212  0.908734  0.009300

In [60]:
newDf.reset_index(drop=True).head() # here it will remove index colum

          A         B         C         D         E
0       584  0.766987  0.083507  0.699666  0.803687
1  0.228043  0.028468  0.327368  0.368833  0.307289
2  0.461548  0.491607  0.116840  0.015457  0.415863
3   0.91865  0.720470  0.969290  0.860569  0.886675
4  0.576811  0.689432  0.619212  0.908734  0.009300

In [61]:
newDf.reset_index(drop=True, inplace=False).head()
# newDf.head()

          A         B         C         D         E
0       584  0.766987  0.083507  0.699666  0.803687
1  0.228043  0.028468  0.327368  0.368833  0.307289
2  0.461548  0.491607  0.116840  0.015457  0.415863
3   0.91865  0.720470  0.969290  0.860569  0.886675
4  0.576811  0.689432  0.619212  0.908734  0.009300

# isnull function

In [62]:
newDf.isnull().head(10) # it return True if any position have no data

       A      B      C      D      E
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False  False
3  False  False  False  False  False
4  False  False  False  False  False
5  False  False  False  False  False
6  False  False  False  False  False
7  False  False  False  False  False
8  False  False  False  False  False
9  False  False  False  False  False

In [63]:
newDf['A'].isnull().head()

0    False
1    False
2    False
3    False
4    False
Name: A, dtype: bool

In [64]:
newDf['B'] = None

In [65]:
newDf.head()

          A     B         C         D         E
0       584  None  0.083507  0.699666  0.803687
1  0.228043  None  0.327368  0.368833  0.307289
2  0.461548  None  0.116840  0.015457  0.415863
3   0.91865  None  0.969290  0.860569  0.886675
4  0.576811  None  0.619212  0.908734  0.009300

In [66]:
newDf.isnull().head()

       A     B      C      D      E
0  False  True  False  False  False
1  False  True  False  False  False
2  False  True  False  False  False
3  False  True  False  False  False
4  False  True  False  False  False

# dropna methods

In [79]:
df = pd.DataFrame({"Name":["Raj","Kamlesh","Sumit"],
                  "Toy":[np.nan,pd.NaT,pd.NaT],
                  "Born":[pd.NaT,pd.Timestamp("1940-05-11"),pd.NaT]})

In [80]:
df

      Name Toy       Born
0      Raj NaT        NaT
1  Kamlesh NaT 1940-05-11
2    Sumit NaT        NaT

In [81]:
df.dropna() # it will drop all na from data set

Empty DataFrame
Columns: [Name, Toy, Born]
Index: []

In [82]:
df.dropna(how='all')

      Name Toy       Born
0      Raj NaT        NaT
1  Kamlesh NaT 1940-05-11
2    Sumit NaT        NaT

In [83]:
df.dropna(how='all',axis=1)

      Name       Born
0      Raj        NaT
1  Kamlesh 1940-05-11
2    Sumit        NaT

# drop_duplicates

In [86]:
df = pd.DataFrame({"Name":["Raj","Kamlesh","Raj"],
                  "Toy":[np.nan,"Diwana",pd.NaT],
                  "Born":[pd.NaT,pd.Timestamp("1940-05-11"),pd.NaT]})

In [87]:
df

      Name     Toy       Born
0      Raj     NaN        NaT
1  Kamlesh  Diwana 1940-05-11
2      Raj     NaT        NaT

In [89]:
df.drop_duplicates() # ti will drop all duplicate form data set

      Name     Toy       Born
0      Raj     NaN        NaT
1  Kamlesh  Diwana 1940-05-11

In [90]:
df

      Name     Toy       Born
0      Raj     NaN        NaT
1  Kamlesh  Diwana 1940-05-11
2      Raj     NaT        NaT

In [91]:
df.drop_duplicates(subset=['Born']) # ti will drop all duplicate form data set

      Name     Toy       Born
0      Raj     NaN        NaT
1  Kamlesh  Diwana 1940-05-11

In [92]:
df.drop_duplicates(subset=['Born'],keep=False)

      Name     Toy       Born
1  Kamlesh  Diwana 1940-05-11

# shape attribute

In [96]:
df.shape

(3, 3)

# info method

In [97]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Toy     1 non-null      object
 2   Born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

# value_counts method

In [101]:
df['Name'].value_counts(dropna=False) # dropna=False means don't count na

Raj        2
Kamlesh    1
Name: Name, dtype: int64

In [104]:
df['Toy'].value_counts(dropna=True)

Diwana    1
Name: Toy, dtype: int64

# notnull() method

In [105]:
df.notnull()

   Name    Toy   Born
0  True  False  False
1  True   True   True
2  True  False  False

# read multiple xlrd sheets

In [ ]:
data = pd.read_excel('exaple.csv', sheet_name = 'example')